# EXL_SetCellString

## Description
Write the cell value as a string.

```pascal
FUNCTION EXL_SetCellString(
				sheetIndex : INTEGER;
				cellRow    : INTEGER;
				cellColumn : INTEGER;
				value      : STRING) : BOOLEAN;
```

```python

def vs.EXL_SetCellString(sheetIndex, cellRow, cellColumn, value):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|sheetIndex|INTEGER||
|cellRow|INTEGER||
|cellColumn|INTEGER||
|value|STRING||

## Version
Availability: from Vectorworks 2021
## Category
* Excel